import { photonadoc, ploterka } from "@/x-config";

// Кол-во файлов для загрузки на странице в корзину
export const numberFilesTotUpload = 3;
// Размер файла для загрузки в Mb-тах
export const sizeFileTotUpload = 20;

// ! Цвета скидок
export const DISCOUNT_COLORS = ['pink', 'red', 'cyan', 'green', 'purple', 'volcano', 'magenta', 'pink', 'green', 'volcano', 'red', 'cyan', 'volcano', 'purple', 'pink', 'red', 'cyan', 'green', 'purple', 'volcano', 'magenta', 'pink', 'red', 'cyan', 'green', 'purple', 'volcano', 'magenta', 'pink', 'red', 'cyan', 'green', 'purple', 'volcano', 'magenta', 'pink', 'red', 'cyan', 'green', 'purple', 'volcano', 'magenta', 'pink', 'red', 'cyan', 'green', 'purple', 'volcano', 'magenta',];


// Константы интервалов цен
export const INTERVALS = {
	banner: [[0, 1], [1, 5], [5, 10], [10, 50], [50, 100], [100, 500], [500, Infinity]], // Площадь
	vizitki: [96,20,500,Infinity], // пропущенно 1000
	samokleyki: [[0, 1], [1, 5], [5, 10], [10, Infinity]], // Площадь
	posterka: [[0, 1], [1, 5], [5, 10], [10, 50], [50, 100], [100, 500], [500, Infinity]], // Площадь
	flagi: [100, 50, 10, 5, 0], // Площадь
	plastik: [[0, 3], [3, 5], [5, 10], [10, 20], [20, 50], [50, Infinity]],  // Площадь
	kserokopya: [[0, 10], [10, 50], [50, 100], [100, 200], [200, 500], [500, Infinity]], // Страницы
	skanirovanie: [[0, 10], [10, 50], [50, Infinity]], // Страницы
	magnitiki: [[0, 3], [3, 10], [10, Infinity]], // Площадь
}




// Промежутки площадей от которых берется цена
export const GOODS_CONFIG = {
// Единичная вложенность: x
	holsty: {
		podramnikCost: 'Цена подрамника',
		holstCost: 'Цена холста',
		jobCost: 'Цена работы',
	},

// ДВОЙНАЯ вложенность: [x]
	flagi: {
		formatToPrice: [['', 'Цена'], ['от 100м2', '50-100м2', '10-50м2', '5-10м2', 'до 5м2']], // цены в зависимости от площади
		drevkoCost: 'Цена древка',
		overlokCost: 'Цена оверлока за 1 пог.мм',
	},
	plastik: {
		squareCost: [['', 'Цена'], [ 'до 3м2', '3-5м2', '5-10м2', '10-20м2', '20-50м2', 'от 50м2']],	
	},
	photonadoc: {
		photonadocCost: [['', 'Цена'], ['Фото', 'Монтаж одежды']]
	},
	shtenderi: {
		shtenderiCost: [['', 'Цена'], ['Info-Sain', 'City-Sain', 'View-Point']]
	},
	// ТРОЙНАЯ вложенность:[[x]]
	banner: {
		bannerCost: [ ['', '400-440', '500'], ['0-1м2', '1-5м2', '5-10м2', '10-50м2', '50-100м2', '100-500м2', 'от 500м2'] ],
		luversCost: 'Цена Люверса', // цена оного люверса
		glueCost: 'Цена проклейки за 1м2', // цена 1 метра проклейки по периметру
		perforaciaCost: 'Цена перфорации за 1 шт', // цена одной дырки перфорации
	},
	samokleyki: {
		samokleykiCost: [ ['', 'до 1', '1-5', '5-10', 'от 10'], ['Белая', 'Черная', 'Цветная', 'Дизайнерская', 'Фотолюм', 'Перфо', 'Прозрачная', 'Светоотражающая'] ],
		porezkaCoast: [['', 'Цена'], ['без порезки', 'A6', 'A5', 'A4', 'A3', 'A2', 'A1']],
		plastickCost: [['', 'Цена'], ['без пластика', 'A0', 'A1', 'A2', 'A3', 'A4']]
	},
	posterka: {
		bannerCost: [ ['', '400-440', '500'], ['0-1м2', '1-5м2', '5-10м2', '10-50м2', '50-100м2', '100-500м2', 'от 500м2'] ],
		luversCost: 'Цена Люверса', // цена оного люверса
		glueCost: 'Цена проклейки за 1м2', // цена 1 метра проклейки по периметру
		perforaciaCost: 'Цена перфорации за 1 шт', // цена одной дырки перфорации
	},
	broschurovka: {
		broschurovkaCost:  [ ['', 'до 15', '15-35', '35-45', '45-60', '60-80', '80-100', '100-120', '120-160', '160-180', '180-200', '200-220', '220-270', '270-300', '300-330', '330-400'], ['Пластик', 'Металл'] ],
	},
	magnitiki: {
		magnitikiCost: [['','0.3 мм', '0.5 мм', '0.75 мм', '2 мм'], ['0-3м2', '3-10м2', 'от10м2']],
	  },

	ploterka: {
		ploterkaCost: [['', 'Порезка', '+ снятие излишков', '+ монтажная пленка'], ['до 1м2', '1-5м2', '5-10м2', 'от 10 м2']],
	},
	// ЧЕТВЕРНАЯ вложенность: [[[x]]]
	kserokopya: {
		kserokopyaCost: [['','','Черно-Белая', 'Цветная'], ['1-10шт', '11-50шт',  '51-100шт', '101-200шт', '201-500шт', 'от501шт'], ['A4', 'A3', 'A2', 'A1', 'A1+', 'A0', 'B0'] ]
	},
	skanirovanie: {
		skanirovanieCost: [['','','Черно-Белая', 'Цветная'], ['1-10шт', '10-50шт', 'от50шт'], ['A4', 'A3', 'A2', 'A1', 'A0'] ]
	},
	laminacia: {
		laminaciaCost: [['','','Глянец', 'Мат.'], ['70мкм', '80мкм', '100мкм', '125мкм', '150мкм', '250мкм'], ['Бейдж', 'A6', 'A5', 'A4', 'A3', 'A2', 'A1'] ]
	},
	// [10, 50, 100, 200, 500, Infinity]
	cherteji: {
		chertejiCost: [['','','1-10', '10-50', '50-100', '100-200', '200-500', 'от500'], ['A4', 'A3', 'A2', 'A1', 'A0', 'B0'] , ['Черно-Белая', 'Цветная'] ],
		falcovkaCost: [['', 'Фальцовка'], ['A4', 'A3', 'A2', 'A1', 'A0', 'B0']]
	},
	rizograf: {
		rizografCost: [['','','до 1к', '1к-2к', '2к-5к', '5к-10к', '10к-20к', 'от 20к'], ['A4', 'A3'], ['Одностор.', 'Двуст.'] ],
		colorCost: [['', 'Цвет.Бум.'], ['A4', 'A3']]
	},
	// ПЯТЕРНАЯ вложенность: [[[[x]]]]
	vizitki: {
		vizitkiCost: [ ['Сторонность','Бумага','Ламинация', '96', '200', '500', '1000'], ['Односторонние', 'Двусторонние'], ['Матовая', 'Глянцевая'], ['Без ламинации', 'Матовая', 'Глянцевая']]
	},
// Шестерная
pechatnabumage: {
	pechatnabumageCost: [['','','','','100-130', '140-150', '160-170', '180-190', '200-210', '220-230', '250-280', '300-330'],['Лазерная', 'Струйная' ], ['A4', 'A3'], ['Матовый', 'Глянцевый'], ['1 сторона', '2 стороны']]
},
}






// Константы интервалов цен
export const COLORS = {
ploterka: {
	'LT4000': [
		['LT4071','#ffffff'],
		['LT4510','#b0b2b1'],
		['LT4073','#797b7a'],
		['LT4075','#4f616b'],
		['LT4081','#252928'],
		['LT4080','#010805'],
		['LT4032','#e2e204'],
		['LT4030','#fbdf02'],
		['LT4033','#fccb02'],
		['LT4031','#fcb600'],
		['LT4022','#ff7700'],
		['LT4023','#f32000'],
		['LT4015','#db0100'],
		['LT4013','#cd0004'],
		['LT4011','#b10005'],
		['LT4025','#ae000d'],
		['LT4019','#620014'],
		['LT4020','#5c000e'],
		['LT4063','#f16b8e'],
		['LT4178','#dc064c'],
		['LT4018','#a40050'],
		['LT4050','#13abda'],
		['LT4054','#006abf'],
		['LT4055','#0055bc'],
		['LT4060','#003296'],
		['LT4065','#00255e'],
		['LT4059','#00276c'],
		['LT4058','#00277f'],
		['LT4056','#001f73'],
		['LT4053','#0b0366'],
		['LT4052','#360058'],
		['LT4051','#000b4f'],
		['LT4041','#008b8c'],
		['LT4000','#01829c'],
		['LT4040','#00758f'],
		['LT4047','#004c63'],
		['LT4042','#01a900'],
		['LT4044','#006700'],
		['LT4048','#00804a'],
		['LT4049','#00885a'],
		['LT4043','#005616'],
		['LT4576','#00571e'],
		['LT4046','#005738'],
		['LT4045','#004c25'],
	],
	'6700 Glossy': [
		['LC6770','#ffffff'],
		['LC6772','#d0d0d0'],
		['LC6773','#86928e'],
		['LC6774','#5f726c'],
		['LC6775','#3e514d'],
		['LC6776','#263a35'],
		['LC6779','#747472'],
		['LC6780','#000000'],
		['LC6739','#8b671c'],
		['LC6737','#ede2b5'],
		['LC6736','#e8d88a'],
		['LC6734','#fffa04'],
		['LC6733','#ffdc03'],
		['LC6732','#fab500'],
		['LC6730','#fab000'],
		['LC6731','#ff9f00'],
		['LC6720','#fe4f00'],
		['LC6721','#f32f05'],
		['LC6713','#d70000'],
		['LC6711','#b60001'],
		['LC6710','#b00000'],
		['LC6716','#730006'],
		['LC6717','#540014'],
		['LC6766','#f77da6'],
		['LC6765','#cf005b'],
		['LC6763','#c78cbc'],
		['LC6762','#71519a'],
		['LC6761','#61074c'],
		['LC6760','#27165d'],
		['LC6759','#0084e6'],
		['LC6758','#006bc9'],
		['LC6757','#0054c5'],
		['LC6756','#0040b7'],
		['LC6755','#003394'],
		['LC6754','#00227f'],
		['LC6753','#00146d'],
		['LC6752','#001561'],
		['LC6751','#001441'],
		['LC6750','#000b1e'],
		['LC6748','#00ceba'],
		['LC6747','#00939d'],
		['LC6746','#00799a'],
		['LC6744','#009b00'],
		['LC6742','#005d3b'],
		['LC6743','#00461b'],
		['LC6741','#003722'],
		['LC6740','#00331f'],
	],
	'LC5100': [
		['LC5110','#f0f0f0'],
		['LC5111','#c0c0c0'],
		['LC5120','#ffd700'],
		['LC5121','#e6c619'],
	]
}}