import prisma from '../lib/api/db'

interface PricesSeeds {
	siteConfig: {
		// размер скидки от 5 - 16 процентов
		discountAmount: [number, 5 | 6 | 7 | 8 | 9 | 10 | 11 | 12 | 13 | 14 | 15 | 16][] },
  	[key: string]: any
}

const pricesSeed: PricesSeeds = {

  siteConfig: {
          discountAmount: [[0,5],[500, 10], [990, 11], [1400, 12], [1800, 13], [2000, 14], [2800, 15], [3500, 16]]
      },
  banner: {
          bannerCost: [ [550, 650], [500, 600], [400, 500], [350, 450], [300, 400], [280, 380], [240, 340], ],
          luversCost: 20, // цена оного люверса
          glueCost: 60, // цена 1 метра проклейки по периметру
          perforaciaCost: 15, // цена одной дырки перфорации
      },
   vizitki: {
          vizitkiCost: [
              [ [ [336, 560, 1000, 1900], [672, 1260, 2750, 5225], [624, 1060, 2250, 4275], ], [ [432, 500, 1100, 2090], [0, 0, 0, 0], [0, 0, 0, 0], ], ],
              [ [ [528, 800, 1750, 3325], [672, 1300, 3000, 5700], [768, 1500, 3500, 6300], ], [ [576, 940, 2250, 4269], [0, 0, 0, 0], [0, 0, 0, 0], ], ],
          ],
      },
  samokleyki: {
          samokleykiCost: [[650,600,550,500],[700,650,650,550],[900,850,800,750],[2500,2330,2150,2000],[5000,4700,4500,4200],[1000,900,850,800],[700,650,600,550],[1500,1400,1300,1200]],
          porezkaCoast: [0,5,7,10,25,42,51], // цена порезки
          plastickCost: [0, 10000, 5200, 2600, 2200, 1800]
      },
  posterka: {
      bannerCost: [ [550, 650], [500, 600], [400, 500], [350, 450], [300, 400], [280, 380], [240, 340], ],
      luversCost: 20, // цена оного люверса
      glueCost: 60, // цена 1 метра проклейки по периметру
      perforaciaCost: 15, // цена одной дырки перфорации
  },
  holsty: {
      podramnikCost: 400, // цена метра деревянного подрамника
      holstCost: 2500, // цена 1 м2 материала холста
      jobCost: 500, // цена изготовления багета за 1 метр подрамника
  },
  flagi: {
      formatToPrice: [800, 850, 900, 950, 1000],
      drevkoCost: 200,
      overlokCost: 150,
  },
  plastik: {
      squareCost: [3500, 3300, 3000, 2900, 2800, 2500],
      
  },
  kserokopya: {
      kserokopyaCost: [[[7, 10], [15, 40], [40,80], [60, 160], [90,240], [120,350],[220,500]],
      [[5, 9], [12, 35], [35,70], [55, 140], [80,220], [110,330],[200,480]],
      [[4.5, 7], [10, 30], [33,60], [50, 120], [75,220], [100,310],[190,450]],
      [[4, 6], [8, 25], [32,55], [45, 100], [70,200], [95,290],[180,440]],
      [[3.5, 5], [6, 20], [30,45], [40, 90], [65,180], [90,240],[150,400]]],
  },
  skanirovanie: {
      skanirovanieCost: [
          [[10, 10], [20, 20], [25,40], [35, 60], [70,100]],
          [[8, 8], [16, 16], [20,35], [30, 50], [60,80]],
          [[7, 7], [14, 14], [15,30], [25, 40], [50,60]]
      ],  
  },
  laminacia: {
      laminaciaCost: [
          [[15,20],[20,25],[30,30],[50,60],[100,100], [0,0], [0,0]],
          [[20,25],[25,30],[35,40],[60,80],[120,130], [0,0], [0,0]],
          [[25,30],[30,35],[40,45],[70,90],[140,150], [250,350], [450,550]],
          [[30,35],[35,40],[45,50],[80,100],[160,180], [250,350], [450,550]],  
          [[35,40],[40,50],[50,60],[100,120],[200,250], [250,350], [450,550]], 
          [[40,50],[45,65],[60,75],[120,150],[250,300], [0,0], [0,0]],  
      ] 
  },
  broschurovka: {
      broschurovkaCost: [
          [60, 0, 70, 0, 80, 0, 100, 120, 0, 140, 180, 220, 240, 280, 350],
          [85, 100, 0, 110, 120, 140, 185, 0, 240, 0 , 260, 0, 0, 0, 0],
      ]
  },
  pechatnabumage: {
      pechatnabumageCost: [// Лазерная или Струйная печать
          [ // Формат
              [ // Матовый Глянцевый
                  [ // Сторонность
                      [28, 30, 32, 34, 35, 37, 40, 45], // Вес бумаги
                      [52, 54, 56, 58, 60, 62, 65, 70], // Цена за бумагу в рублях, 185, 0],
                  ], [ [28, 30, 32, 34, 35, 37, 40, 45], [52, 54, 56, 58, 60, 62, 65, 70], ] ], [ [ [55, 60, 65, 70, 70, 75, 80, 90], [55, 60, 65, 70, 70, 75, 80, 90], ], [ [75, 85, 90, 100, 120, 125, 130, 150], [75, 85, 90, 100, 120, 125, 130, 150], ] ] ],
          [ [ [ [18, 20, 23, 27, 30, 35, 40, 45], [34, 38, 42, 46, 52, 60, 65, 85], ], [ [20, 25, 30, 35, 40, 45, 50, 55], [40, 45, 55, 65, 70, 80, 90, 95], ] ], [ [ [50, 55, 60, 65, 70, 80, 90, 95], [80, 110, 120, 130, 130, 80, 90, 95], ], [ [60, 70, 75, 85, 90, 80, 90, 95], [115, 125, 135, 145, 150, 80, 90, 95], ] ] ]
      ]
  },
  photonadoc: {
      photonadocCost: [200, 100]
  },
  cherteji: {
      chertejiCost: [
                      [ 
                          [10, 8, 7, 5, 4.5, 4],
                          [20, 18, 15, 13, 10, 8]
                      ],
                      [ 
                          [20, 18, 15, 13, 11, 10],
                          [60, 55, 50, 45, 40, 35]
                      ],
                      [ 
                          [100, 95, 90, 85, 80, 75],
                          [150, 145, 140, 135, 130, 125]
                      ],
                      [ 
                          [200, 190, 180, 170, 160, 150],
                          [300, 290, 280, 270, 260, 250]
                      ],
                      [ 
                          [400, 380, 360, 340, 320, 300],
                          [600, 580, 560, 540, 520, 500]
                      ],
                      [ 
                          [550, 530, 510, 490, 470, 450],
                          [750, 730, 710, 690, 670, 650]
                      ],
                  ],
      falcovkaCost: [5,15,20,30,35,42]
  },
  rizograf: {
      rizografCost: [
          [
              [4,3.8,3.6,3.2,3,2.5],
              [7.5,6.5,7,6.5,5.5,4.5],
          ],
          [
              [4,3.8,3.6,3.2,3,2.5],
              [7.5,6.5,7,6.5,5.5,4.5],
          ],
      ],
      colorCost: [3, 20]
  },
  shtenderi: {
      shtenderiCost: [2729, 2729, 4890],
  },
  bagety: {
      bagetyCost: [0],
  },
  magnitiki: {
	magnitikiCost: [[2800, 3800, 4800, 6500], [2400, 3400, 4400, 6100], [2000, 3000, 4000, 5700]],
  },
  ploterka: {
	ploterkaCost: [[1800, 3500, 4000], [1700, 3200, 3600], [1600, 3100, 3400], [1500, 3000, 3300]],
  },
};





async function seedData() {
	try {
        let data = []
        const seedsPricesKeys = Object.keys(pricesSeed)
        for(let i = 0; i < seedsPricesKeys.length; i++){
          data.push({name: seedsPricesKeys[i], jsonPrice: JSON.stringify(pricesSeed[seedsPricesKeys[i]]) })
        }
        const manyPrices = await prisma.price.createMany({
                data,
                skipDuplicates: true,
            })
        console.log('Finished seeding.')
        return manyPrices;
      } catch (err) {
        console.log(err)
      }
}
  
  seedData()
    .then(async () => {
      await prisma.$disconnect()
    })
    .catch(async (e) => {
      console.error(e)
      await prisma.$disconnect()
      process.exit(1)
    })